InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
/**
 *
 * @file EEPROM_RegisterDefines.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 21 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 21 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_PERIPHERAL_EEPROM_REGISTER_EEPROM_REGISTERDEFINES_H_
#define XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_PERIPHERAL_EEPROM_REGISTER_EEPROM_REGISTERDEFINES_H_

#include <xDriver_MCU/EEPROM/Peripheral/xHeader/EEPROM_Enum.h>

/******************************************************************************************
************************************ 1 SIZE *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_SIZE_R_WORDCNT_MASK    ((UBase_t) 0x0000FFFFUL)
#define EEPROM_SIZE_R_WORDCNT_BIT    (0UL)
#define EEPROM_SIZE_R_WORDCNT_NUMBER    ((UBase_t) 0x00000200UL)

#define EEPROM_SIZE_WORDCNT_MASK    ((UBase_t) 0x0000FFFFUL)
#define EEPROM_SIZE_WORDCNT_NUMBER    ((UBase_t) 0x00000200UL)
/*----------*/

/*----------*/
#define EEPROM_SIZE_R_BLKCNT_MASK    ((UBase_t) 0x07FF0000UL)
#define EEPROM_SIZE_R_BLKCNT_BIT    (16UL)
#define EEPROM_SIZE_R_BLKCNT_NUMBER    ((UBase_t) 0x00200000UL)

#define EEPROM_SIZE_BLKCNT_MASK    ((UBase_t) 0x000007FFUL)
#define EEPROM_SIZE_BLKCNT_NUMBER    ((UBase_t) 0x00000020UL)
/*----------*/

/******************************************************************************************
************************************ 2 BLOCK *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_BLOCK_R_BLOCK_MASK    ((UBase_t) 0x0000FFFFUL)
#define EEPROM_BLOCK_R_BLOCK_BIT    (0UL)

#define EEPROM_BLOCK_BLOCK_MASK    ((UBase_t) 0x0000FFFFUL)
/*----------*/

/******************************************************************************************
************************************ 3 OFFSET *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_OFFSET_R_OFFSET_MASK    ((UBase_t) 0x0000000FUL)
#define EEPROM_OFFSET_R_OFFSET_BIT    (0UL)

#define EEPROM_OFFSET_OFFSET_MASK    ((UBase_t) 0x0000000FUL)
/*----------*/

/******************************************************************************************
************************************ 4 RDWR *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_RDWR_R_VALUE_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_RDWR_R_VALUE_BIT    (0UL)

#define EEPROM_RDWR_VALUE_MASK    ((UBase_t) 0xFFFFFFFFUL)
/*----------*/

/******************************************************************************************
************************************ 5 RDWRINC *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_RDWRINC_R_VALUE_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_RDWRINC_R_VALUE_BIT    (0UL)

#define EEPROM_RDWRINC_VALUE_MASK    ((UBase_t) 0xFFFFFFFFUL)
/*----------*/

/******************************************************************************************
************************************ 6 DONE *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_DONE_R_WORKING_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DONE_R_WORKING_BIT    (0UL)
#define EEPROM_DONE_R_WORKING_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_R_WORKING_ENA    ((UBase_t) 0x00000001UL)

#define EEPROM_DONE_WORKING_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DONE_WORKING_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_WORKING_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_DONE_R_WKERASE_MASK    ((UBase_t) 0x00000004UL)
#define EEPROM_DONE_R_WKERASE_BIT    (2UL)
#define EEPROM_DONE_R_WKERASE_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_R_WKERASE_ENA    ((UBase_t) 0x00000004UL)

#define EEPROM_DONE_WKERASE_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DONE_WKERASE_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_WKERASE_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_DONE_R_WKCOPY_MASK    ((UBase_t) 0x00000008UL)
#define EEPROM_DONE_R_WKCOPY_BIT    (3UL)
#define EEPROM_DONE_R_WKCOPY_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_R_WKCOPY_ENA    ((UBase_t) 0x00000008UL)

#define EEPROM_DONE_WKCOPY_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DONE_WKCOPY_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_WKCOPY_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_DONE_R_NOPERM_MASK    ((UBase_t) 0x00000010UL)
#define EEPROM_DONE_R_NOPERM_BIT    (4UL)
#define EEPROM_DONE_R_NOPERM_NOERROR    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_R_NOPERM_ERROR    ((UBase_t) 0x00000010UL)

#define EEPROM_DONE_NOPERM_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DONE_NOPERM_NOERROR    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_NOPERM_ERROR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_DONE_R_WRBUSY_MASK    ((UBase_t) 0x00000020UL)
#define EEPROM_DONE_R_WRBUSY_BIT    (5UL)
#define EEPROM_DONE_R_WRBUSY_NOERROR    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_R_WRBUSY_ERROR    ((UBase_t) 0x00000020UL)

#define EEPROM_DONE_WRBUSY_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DONE_WRBUSY_NOERROR    ((UBase_t) 0x00000000UL)
#define EEPROM_DONE_WRBUSY_ERROR    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************7 SUPP *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_SUPP_R_START_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_SUPP_R_START_BIT    (0UL)
#define EEPROM_SUPP_R_START_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_R_START_ENA    ((UBase_t) 0x00000001UL)

