InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
#define EEPROM_SUPP_START_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_SUPP_START_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_START_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_SUPP_R_EREQ_MASK    ((UBase_t) 0x00000002UL)
#define EEPROM_SUPP_R_EREQ_BIT    (1UL)
#define EEPROM_SUPP_R_EREQ_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_R_EREQ_ENA    ((UBase_t) 0x00000002UL)

#define EEPROM_SUPP_EREQ_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_SUPP_EREQ_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_EREQ_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_SUPP_R_ERETRY_MASK    ((UBase_t) 0x00000004UL)
#define EEPROM_SUPP_R_ERETRY_BIT    (2UL)
#define EEPROM_SUPP_R_ERETRY_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_R_ERETRY_ENA    ((UBase_t) 0x00000004UL)

#define EEPROM_SUPP_ERETRY_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_SUPP_ERETRY_DIS    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_ERETRY_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_SUPP_R_PRETRY_MASK    ((UBase_t) 0x00000008UL)
#define EEPROM_SUPP_R_PRETRY_BIT    (3UL)
#define EEPROM_SUPP_R_PRETRY_NOERROR    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_R_PRETRY_ERROR    ((UBase_t) 0x00000008UL)

#define EEPROM_SUPP_PRETRY_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_SUPP_PRETRY_NOERROR    ((UBase_t) 0x00000000UL)
#define EEPROM_SUPP_PRETRY_ERROR    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************8 UNLOCK *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_UNLOCK_R_UNLOCK_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_UNLOCK_R_UNLOCK_BIT    (0UL)

#define EEPROM_UNLOCK_UNLOCK_MASK    ((UBase_t) 0xFFFFFFFFUL)
/*----------*/

/******************************************************************************************
************************************ 9 PROT *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_PROT_R_PROT_MASK    ((UBase_t) 0x00000007UL)
#define EEPROM_PROT_R_PROT_BIT    (0UL)
#define EEPROM_PROT_R_PROT_NOPASS_RDWR    ((UBase_t) 0x00000000UL)
#define EEPROM_PROT_R_PROT_PASS_RDWR    ((UBase_t) 0x00000001UL)
#define EEPROM_PROT_R_PROT_NOPASS_RD    ((UBase_t) 0x00000002UL)

#define EEPROM_PROT_PROT_MASK    ((UBase_t) 0x00000007UL)
#define EEPROM_PROT_PROT_NOPASS_RDWR    ((UBase_t) 0x00000000UL)
#define EEPROM_PROT_PROT_PASS_RDWR    ((UBase_t) 0x00000001UL)
#define EEPROM_PROT_PROT_NOPASS_RD    ((UBase_t) 0x00000002UL)
/*----------*/

/*----------*/
#define EEPROM_PROT_R_ACC_MASK    ((UBase_t) 0x00000008UL)
#define EEPROM_PROT_R_ACC_BIT    (3UL)
#define EEPROM_PROT_R_ACC_BOTH    ((UBase_t) 0x00000000UL)
#define EEPROM_PROT_R_ACC_SUPERVISOR    ((UBase_t) 0x00000008UL)

#define EEPROM_PROT_ACC_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_PROT_ACC_BOTH    ((UBase_t) 0x00000000UL)
#define EEPROM_PROT_ACC_SUPERVISOR    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************ 10 PASS0 *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_PASS0_R_PASS_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_PASS0_R_PASS_BIT    (0UL)
#define EEPROM_PASS0_R_PASS_NOSET    ((UBase_t) 0x00000000UL)
#define EEPROM_PASS0_R_PASS_SET    ((UBase_t) 0x00000001UL)

#define EEPROM_PASS0_PASS_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_PASS0_PASS_NOSET    ((UBase_t) 0x00000000UL)
#define EEPROM_PASS0_PASS_SET    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************11 PASS1 *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_PASS1_R_PASS_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_PASS1_R_PASS_BIT    (0UL)
#define EEPROM_PASS1_R_PASS_NOSET    ((UBase_t) 0x00000000UL)
#define EEPROM_PASS1_R_PASS_SET    ((UBase_t) 0x00000001UL)

#define EEPROM_PASS1_PASS_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_PASS1_PASS_NOSET    ((UBase_t) 0x00000000UL)
#define EEPROM_PASS1_PASS_SET    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************12 PASS2 *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_PASS2_R_PASS_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_PASS2_R_PASS_BIT    (0UL)
#define EEPROM_PASS2_R_PASS_NOSET    ((UBase_t) 0x00000000UL)
#define EEPROM_PASS2_R_PASS_SET    ((UBase_t) 0x00000001UL)

#define EEPROM_PASS2_PASS_MASK    ((UBase_t) 0xFFFFFFFFUL)
#define EEPROM_PASS2_PASS_NOSET    ((UBase_t) 0x00000000UL)
#define EEPROM_PASS2_PASS_SET    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************13 INT *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_INT_R_INT_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_INT_R_INT_BIT    (0UL)
#define EEPROM_INT_R_INT_INACTIVE    ((UBase_t) 0x00000000UL)
#define EEPROM_INT_R_INT_ACTIVE    ((UBase_t) 0x00000001UL)

#define EEPROM_INT_INT_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_INT_INT_INACTIVE    ((UBase_t) 0x00000000UL)
#define EEPROM_INT_INT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************14 HIDE *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_HIDE_R_H1_MASK    ((UBase_t) 0x00000002UL)
#define EEPROM_HIDE_R_H1_BIT    (1UL)
#define EEPROM_HIDE_R_H1_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H1_HIDE    ((UBase_t) 0x00000002UL)

#define EEPROM_HIDE_H1_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H1_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H1_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H2_MASK    ((UBase_t) 0x00000004UL)
#define EEPROM_HIDE_R_H2_BIT    (2UL)
#define EEPROM_HIDE_R_H2_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H2_HIDE    ((UBase_t) 0x00000004UL)

