InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
#define EEPROM_HIDE_H2_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H2_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H2_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H3_MASK    ((UBase_t) 0x00000008UL)
#define EEPROM_HIDE_R_H3_BIT    (3UL)
#define EEPROM_HIDE_R_H3_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H3_HIDE    ((UBase_t) 0x00000008UL)

#define EEPROM_HIDE_H3_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H3_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H3_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H4_MASK    ((UBase_t) 0x00000010UL)
#define EEPROM_HIDE_R_H4_BIT    (4UL)
#define EEPROM_HIDE_R_H4_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H4_HIDE    ((UBase_t) 0x000000010UL)

#define EEPROM_HIDE_H4_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H4_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H4_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H5_MASK    ((UBase_t) 0x00000020UL)
#define EEPROM_HIDE_R_H5_BIT    (5UL)
#define EEPROM_HIDE_R_H5_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H5_HIDE    ((UBase_t) 0x00000020UL)

#define EEPROM_HIDE_H5_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H5_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H5_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H6_MASK    ((UBase_t) 0x00000040UL)
#define EEPROM_HIDE_R_H6_BIT    (6UL)
#define EEPROM_HIDE_R_H6_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H6_HIDE    ((UBase_t) 0x00000040UL)

#define EEPROM_HIDE_H6_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H6_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H6_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H7_MASK    ((UBase_t) 0x00000080UL)
#define EEPROM_HIDE_R_H7_BIT    (7UL)
#define EEPROM_HIDE_R_H7_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H7_HIDE    ((UBase_t) 0x00000080UL)

#define EEPROM_HIDE_H7_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H7_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H7_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H8_MASK    ((UBase_t) 0x00000100UL)
#define EEPROM_HIDE_R_H8_BIT    (8UL)
#define EEPROM_HIDE_R_H8_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H8_HIDE    ((UBase_t) 0x00000100UL)

#define EEPROM_HIDE_H8_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H8_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H8_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H9_MASK    ((UBase_t) 0x00000200UL)
#define EEPROM_HIDE_R_H9_BIT    (9UL)
#define EEPROM_HIDE_R_H9_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H9_HIDE    ((UBase_t) 0x00000200UL)

#define EEPROM_HIDE_H9_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H9_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H9_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H10_MASK    ((UBase_t) 0x00000400UL)
#define EEPROM_HIDE_R_H10_BIT    (10UL)
#define EEPROM_HIDE_R_H10_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H10_HIDE    ((UBase_t) 0x00000400UL)

#define EEPROM_HIDE_H10_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H10_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H10_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H11_MASK    ((UBase_t) 0x00000800UL)
#define EEPROM_HIDE_R_H11_BIT    (11UL)
#define EEPROM_HIDE_R_H11_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H11_HIDE    ((UBase_t) 0x00000800UL)

#define EEPROM_HIDE_H11_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H11_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H11_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H12_MASK    ((UBase_t) 0x00001000UL)
#define EEPROM_HIDE_R_H12_BIT    (12UL)
#define EEPROM_HIDE_R_H12_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H12_HIDE    ((UBase_t) 0x00001000UL)

#define EEPROM_HIDE_H12_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H12_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H12_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H13_MASK    ((UBase_t) 0x00002000UL)
#define EEPROM_HIDE_R_H13_BIT    (13UL)
#define EEPROM_HIDE_R_H13_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H13_HIDE    ((UBase_t) 0x00002000UL)

#define EEPROM_HIDE_H13_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H13_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H13_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H14_MASK    ((UBase_t) 0x00004000UL)
#define EEPROM_HIDE_R_H14_BIT    (14UL)
#define EEPROM_HIDE_R_H14_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H14_HIDE    ((UBase_t) 0x00004000UL)

#define EEPROM_HIDE_H14_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H14_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H14_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H15_MASK    ((UBase_t) 0x00008000UL)
#define EEPROM_HIDE_R_H15_BIT    (15UL)
#define EEPROM_HIDE_R_H15_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H15_HIDE    ((UBase_t) 0x00008000UL)

#define EEPROM_HIDE_H15_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H15_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H15_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H16_MASK    ((UBase_t) 0x00010000UL)
#define EEPROM_HIDE_R_H16_BIT    (16UL)
#define EEPROM_HIDE_R_H16_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H16_HIDE    ((UBase_t) 0x00010000UL)

#define EEPROM_HIDE_H16_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H16_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H16_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H17_MASK    ((UBase_t) 0x00020000UL)
#define EEPROM_HIDE_R_H17_BIT    (17UL)
#define EEPROM_HIDE_R_H17_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H17_HIDE    ((UBase_t) 0x00020000UL)

#define EEPROM_HIDE_H17_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H17_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H17_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H18_MASK    ((UBase_t) 0x00040000UL)
#define EEPROM_HIDE_R_H18_BIT    (18UL)
#define EEPROM_HIDE_R_H18_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H18_HIDE    ((UBase_t) 0x00040000UL)

#define EEPROM_HIDE_H18_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H18_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H18_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H19_MASK    ((UBase_t) 0x00080000UL)
#define EEPROM_HIDE_R_H19_BIT    (19UL)
#define EEPROM_HIDE_R_H19_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H19_HIDE    ((UBase_t) 0x00080000UL)

