InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
#define EEPROM_HIDE_H19_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H19_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H19_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H20_MASK    ((UBase_t) 0x00100000UL)
#define EEPROM_HIDE_R_H20_BIT    (20UL)
#define EEPROM_HIDE_R_H20_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H20_HIDE    ((UBase_t) 0x00100000UL)

#define EEPROM_HIDE_H20_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H20_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H20_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H21_MASK    ((UBase_t) 0x00200000UL)
#define EEPROM_HIDE_R_H21_BIT    (21UL)
#define EEPROM_HIDE_R_H21_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H21_HIDE    ((UBase_t) 0x00200000UL)

#define EEPROM_HIDE_H21_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H21_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H21_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H22_MASK    ((UBase_t) 0x00400000UL)
#define EEPROM_HIDE_R_H22_BIT    (22UL)
#define EEPROM_HIDE_R_H22_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H22_HIDE    ((UBase_t) 0x00400000UL)

#define EEPROM_HIDE_H22_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H22_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H22_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H23_MASK    ((UBase_t) 0x00800000UL)
#define EEPROM_HIDE_R_H23_BIT    (23UL)
#define EEPROM_HIDE_R_H23_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H23_HIDE    ((UBase_t) 0x00800000UL)

#define EEPROM_HIDE_H23_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H23_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H23_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H24_MASK    ((UBase_t) 0x01000000UL)
#define EEPROM_HIDE_R_H24_BIT    (24UL)
#define EEPROM_HIDE_R_H24_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H24_HIDE    ((UBase_t) 0x01000000UL)

#define EEPROM_HIDE_H24_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H24_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H24_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H25_MASK    ((UBase_t) 0x02000000UL)
#define EEPROM_HIDE_R_H25_BIT    (25UL)
#define EEPROM_HIDE_R_H25_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H25_HIDE    ((UBase_t) 0x02000000UL)

#define EEPROM_HIDE_H25_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H25_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H25_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H26_MASK    ((UBase_t) 0x04000000UL)
#define EEPROM_HIDE_R_H26_BIT    (26UL)
#define EEPROM_HIDE_R_H26_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H26_HIDE    ((UBase_t) 0x04000000UL)

#define EEPROM_HIDE_H26_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H26_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H26_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H27_MASK    ((UBase_t) 0x08000000UL)
#define EEPROM_HIDE_R_H27_BIT    (27UL)
#define EEPROM_HIDE_R_H27_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H27_HIDE    ((UBase_t) 0x08000000UL)

#define EEPROM_HIDE_H27_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H27_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H27_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H28_MASK    ((UBase_t) 0x10000000UL)
#define EEPROM_HIDE_R_H28_BIT    (28UL)
#define EEPROM_HIDE_R_H28_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H28_HIDE    ((UBase_t) 0x10000000UL)

#define EEPROM_HIDE_H28_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H28_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H28_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H29_MASK    ((UBase_t) 0x20000000UL)
#define EEPROM_HIDE_R_H29_BIT    (29UL)
#define EEPROM_HIDE_R_H29_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H29_HIDE    ((UBase_t) 0x20000000UL)

#define EEPROM_HIDE_H29_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H29_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H29_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H30_MASK    ((UBase_t) 0x40000000UL)
#define EEPROM_HIDE_R_H30_BIT    (30UL)
#define EEPROM_HIDE_R_H30_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H30_HIDE    ((UBase_t) 0x40000000UL)

#define EEPROM_HIDE_H30_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H30_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H30_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_HIDE_R_H31_MASK    ((UBase_t) 0x80000000UL)
#define EEPROM_HIDE_R_H31_BIT    (31UL)
#define EEPROM_HIDE_R_H31_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_R_H31_HIDE    ((UBase_t) 0x80000000UL)

#define EEPROM_HIDE_H31_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_HIDE_H31_NOHIDE    ((UBase_t) 0x00000000UL)
#define EEPROM_HIDE_H31_HIDE    ((UBase_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************15 DBGME *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_DBGME_R_ME_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DBGME_R_ME_BIT    (0UL)
#define EEPROM_DBGME_R_ME_NA    ((UBase_t) 0x00000000UL)
#define EEPROM_DBGME_R_ME_ERASE    ((UBase_t) 0x00000001UL)

#define EEPROM_DBGME_ME_MASK    ((UBase_t) 0x00000001UL)
#define EEPROM_DBGME_ME_NA    ((UBase_t) 0x00000000UL)
#define EEPROM_DBGME_ME_ERASE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define EEPROM_DBGME_R_KEY_MASK    ((UBase_t) 0xFFFF0000UL)
#define EEPROM_DBGME_R_KEY_BIT    (0UL)
#define EEPROM_DBGME_R_KEY_ERASE    ((UBase_t) 0xE37B0000UL)

#define EEPROM_DBGME_KEY_MASK    ((UBase_t) 0x0000FFFFUL)
#define EEPROM_DBGME_KEY_ERASE    ((UBase_t) 0x0000E37BUL)
/*----------*/

/******************************************************************************************
************************************16 PP *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_PP_R_SIZE_MASK    ((UBase_t) 0x0000001FUL)
#define EEPROM_PP_R_SIZE_BIT    (0UL)
#define EEPROM_PP_R_SIZE_2KB    ((UBase_t) 0x0000001FUL)

#define EEPROM_PP_SIZE_MASK    ((UBase_t) 0x0000001FUL)
#define EEPROM_PP_SIZE_2KB    ((UBase_t) 0x0000001FUL)
/*----------*/



#endif /* XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_PERIPHERAL_EEPROM_REGISTER_EEPROM_REGISTERDEFINES_H_ */
